Revit 2027 API
FabricationService.GetPaletteName Method
 Gets the name of a palette based on palette index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetPaletteName(
	int palette
)
Public Function GetPaletteName (
	palette As Integer
) As String
public:
String^ GetPaletteName(
	int palette
)
member GetPaletteName :
        palette : int -> string
Parameters
palette Int32
 The index of the palette.
Return Value
String
 The name of the palette.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index palette is not larger or equal to 0 and less than PaletteCount.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace